app/controllers/todolists_controller.rb

INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["body", ""], ["created_at", "2019-10-08 05:27:21.755803"], ["updated_at", "2019-10-08 05:27:21.755803"]]
---
   def create
        # ストロングパラメーターを使用
         list = List.new(list_params)
        # DBへ保存する
         list.save

SELECT "lists".* FROM "lists"
---
    def index
    	@lists = List.all

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def show
    	@list = List.find(params[:id])

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
    	@list = List.find(params[:id])

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "変更後"], ["body", "変更後"], ["updated_at", "2019-10-08 10:31:07.876479"], ["id", 1]]
---
    def update
        list = List.find(params[:id])
        list.update(list_params)

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]
---
    def destroy
    	list = List.find(params[:id]) #データ(レコード)を1件取得
        list.destroy #データ（レコード）を削除